pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
void stampaOra()
{
  DateTime now = rtc.now();
  Serial.print("Ora: ");
  Serial.print((now.hour() < 10 ? "0" : "") + String(now.hour(), DEC));
  Serial.print(":");
  Serial.print((now.minute() < 10 ? "0" : "") + String(now.minute(), DEC));
  Serial.print(":");
  Serial.println((now.second() < 10 ? "0" : "") + String(now.second(), DEC));
}

String readTemperatureAndHumidity()
{
  static u_int8_t count = 0;

  float temperature = htu.readTemperature(); // Legge la temperatura
  float humidity = htu.readHumidity();       // Legge l'umidità

  // Controlla se ci sono errori nella lettura
  if (isnan(temperature) || isnan(humidity))
  {
    Serial.println("Errore nella lettura del sensore!");
    return "";
  }

  // Formatta i valori float in una stringa
  String bufferTemp;
  if (count == 0)
  {
    bufferTemp = "Tmp:" + (String)temperature + "C";
  }
  else
  {
    bufferTemp = "Umd:" + (String)humidity + "%";
  }

  count = (count + 1) % 2;

  return bufferTemp;
}

void visualizzaTemperaturaUmidita()
{
  dma_display->fillRect(0, 0, PANEL_RES_X, 8, 0);
  dma_display->setCursor(2, 0);
  dma_display->setTextSize(1);
  dma_display->setTextColor(dma_display->color565(255, 0, 0));
  dma_display->setTextWrap(false);
  dma_display->print(readTemperatureAndHumidity());
}

// Funzione per rimuovere duplicati da una lista di String
void rimuoveDuplicati(List<String> &list)
{
  for (int i = 0; i < list.getSize(); i++)
  {
    String current = list.get(i);

    // Controlla tutti gli elementi successivi
    for (int j = i + 1; j < list.getSize(); j++)
    {
      if (list.get(j) == current)
      {
        Serial.println("Rimuovo duplicato: " + current);
        list.remove(j);
        j--; // importantissimo: la lista si compatta
      }
    }
  }
}

// Funzione per scaricare, pulire e fare il parsing del feed RSS
void fetchRSSFeed()
{
  Serial.println("Recupero feed RSS...");
  scaricaFeed(rss_feed_url, "/feed.xml");
  cleanupFeed("/feed.xml", "/feed_clean.xml");
  if (parseRSS("/feed_clean.xml"))
  {
    newsUpdateInterval = 1200000; // Ripristina l'intervallo normale in caso di successo
    rimuoveDuplicati(newsList);   // Rimuove duplicati
  }
  else
  {
    newsUpdateInterval = 120000; // Riduci l'intervallo in caso di errore
  }
}

void setup()
{
  Serial.begin(115200);
  esp_reset_reason_t reason = esp_reset_reason();
  Serial.print("Motivo Reset: ");
  switch (reason)
  {
  case ESP_RST_POWERON:
    Serial.println("Power-on reset");
    break;
  case ESP_RST_EXT:
    Serial.println("External reset");
    break;
  case ESP_RST_SW:
    Serial.println("Software reset");
    break;
  case ESP_RST_PANIC:
    Serial.println("Exception/panic reset");
    break;
  case ESP_RST_INT_WDT:
    Serial.println("Interrupt watchdog reset");
    break;
  case ESP_RST_TASK_WDT:
    Serial.println("Task watchdog reset");
    break;
  case ESP_RST_WDT:
    Serial.println("Other watchdog reset");
    break;
  case ESP_RST_DEEPSLEEP:
    Serial.println("Wake from deep sleep");
    break;
  default:
    Serial.println("Unknown reason");
    break;
  }

  SPI.begin(18, 19, 23, SD_CS); // SCK = 18, MISO = 19, MOSI = 23
  // Configura i pin fisici

  if (!SD.begin(SD_CS))
  {
    Serial.println("Errore inizializzazione scheda SD");
    return;
  }
  Serial.println("Scheda SD inizializzata.");

  // Connessione WiFi
  Serial.println("Connessione al WiFi");

  // Impostazioni per una riconnessione "aggressiva"
  // WiFi.persistent(false);       // evita scritture lente nella flash
  // WiFi.setAutoReconnect(true);  // tenta sempre
  // WiFi.setSleep(false);         // evita perdite di connessione
  // WiFi.mode(WIFI_STA);

  // Registrazione eventi
  wifiConnectHandler = WiFi.onEvent(onWifiConnect, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP);
  wifiDisconnectHandler = WiFi.onEvent(onWifiDisconnect, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED);

  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  /*
  int n = 0;
  while (WiFi.status() != WL_CONNECTED)
  {
    Serial.print(".");
    delay(1000);
    n++;
    if (n >= 10)
    {
      ESP.restart();
      delay(3000);
      n = 0;
    }
  }

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.println("\nConnected to WiFi");
    Serial.print("IP Address: ");
    Serial.println(WiFi.localIP());

    // delay(2000); // Attendi 2 secondi per stabilizzare la connessione
  }
  else
  {
    Serial.println("\nNot connected to WiFi");
  }
  */

  // Inizializza I2C (puoi cambiare i pin se necessario)
  Wire.begin(21, 22); // SDA = 21, SCL = 22

  // Inizializza il sensore
  if (!htu.begin())
  {
    Serial.println("Errore: HTU21D non trovato!");
    while (1)
      ;
  }

  Serial.println("HTU21D inizializzato correttamente");

  // Imposta il fuso orario italiano con ora legale
  configTzTime("CET-1CEST,M3.5.0/2,M10.5.0/3", "pool.ntp.org");

  // Avvia il client NTP
  // timeClient.begin();

  pinMode(LDR_PIN, INPUT); // Imposta il pin LDR come ingresso

  // initializing the rtc
  if (!rtc.begin())
  {
    Serial.println("Couldn't find RTC!");
    Serial.flush();
    // while (1) delay(10);
    delay(3000);
    ESP.restart(); // Riavvia il dispositivo
  }

  if (rtc.lostPower())
  {
    // this will adjust to the date and time at compilation
    // rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    Serial.println("RTC lost power, setting default time...");
  }

  // we don't need the 32K Pin, so disable it
  rtc.disable32K();

  // Imposta il modulo DS3231 per generare un segnale SQW di 1Hz (necessario per rilevare l'inizio di ogni ora)
  rtc.writeSqwPinMode(DS3231_SquareWave1Hz);
  Serial.println("Modulo RTC DS3231 configurato.");

  syncRTCwithNTP(); // Sincronizza all'avvio

  // Module configuration
  HUB75_I2S_CFG mxconfig(
      PANEL_RES_X, // module width
      PANEL_RES_Y, // module height
      PANEL_CHAIN, // Chain length
      _pins);

  //  ::SHIFTREG; // Tipico per pannelli HUB75
  mxconfig.driver = HUB75_I2S_CFG::FM6126A;

  // Display Setup
  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  // dma_display->begin();

  // Allocate memory and start DMA display
  if (not dma_display->begin())
    Serial.println("****** !KABOOM! HUB75 memory allocation failed ***********");
  dma_display->setBrightness8(brightness); // 0-255
  dma_display->clearScreen();
  dma_display->fillScreen(myBLACK);

  fetchRSSFeed();

