pardente4702/esp32_rgb_led_matrix_clock/src/main.cpp
  visualizzaTemperaturaUmidita();
}

void gestisciOrologio()
{

  DateTime now = rtc.now();
  String hours = (now.hour() < 10 ? "0" : "") + String(now.hour(), DEC);
  String minutes = (now.minute() < 10 ? "0" : "") + String(now.minute(), DEC);
  String seconds = (now.second() < 10 ? "0" : "") + String(now.second(), DEC);

  char timeStr[9];
  sprintf(timeStr, "%s:%s:%s", hours, minutes, seconds);

  if (strcmp(timeStr, lastTimeStr) != 0)
  {                                                  // Aggiorna solo se cambia
    dma_display->fillRect(0, 16, PANEL_RES_X, 8, 0); // Cancella solo l'area dell'orario
    dma_display->setCursor(8, 16);
    dma_display->setTextSize(1);
    dma_display->setTextColor(dma_display->color565(100, 200, 255));
    dma_display->print(timeStr);
    strcpy(lastTimeStr, timeStr);
  }

  // Reload news list
  static unsigned long lastUpdateNewsTime = 0;
  if (millis() > lastUpdateNewsTime + newsUpdateInterval)
  {
    Serial.println("Reload news...");
    lastUpdateNewsTime = millis();
    indiceNotizia = 0;
    textX = PANEL_RES_X;
    // fetchRSSFeed();
  }

  static unsigned long lastUpdateDisplay = 0;
  if ((millis() > lastUpdateDisplay + scrollingSpeed) && (newsList.getSize() > 0))
  {
    lastUpdateDisplay = millis();
    String notizia = newsList.get(indiceNotizia);

    notizia.toCharArray(scrollingText, sizeof(scrollingText));
    // Testo scorrevole
    dma_display->fillRect(0, 24, PANEL_RES_X, 8, 0); // Cancella solo la riga del testo scorrevole
    dma_display->setCursor(textX, 24);
    dma_display->setTextSize(1);
    dma_display->setTextColor(dma_display->color565(255, 255, 0));
    dma_display->print(scrollingText);
    // dma_display->show();

    textX--;
    int limiteNegativo = 0 - ((notizia.length()) * 6);
    if (textX < limiteNegativo)
    {
      // Serial.print("Visualizzo la notizia numero ");
      // Serial.println(indiceNotizia);
      textX = PANEL_RES_X;
      indiceNotizia++;
      indiceNotizia = indiceNotizia % newsList.getSize();
    }
  }

  // Aggiorna la luminosità e la temperatura ogni 30 secondi
  static unsigned long lastUpdateTime = 0;
  if (millis() > lastUpdateTime + tempBrightnessUpdateInterval)
  {
    lastUpdateTime = millis();

    visualizzaTemperaturaUmidita();

    int ldrValue = analogRead(LDR_PIN); // Legge il valore analogico dal sensore LDR
    // Serial.print("LDR value: ");
    // Serial.println(ldrValue); // Stampa il valore letto nel monitor seriale

    // Adatta questi range in base al tuo ambiente reale
    brightness = map(ldrValue, 4000, 100, brightnessMin, brightnessMax);
    brightness = constrain(brightness, brightnessMin, brightnessMax);
    dma_display->setBrightness8(brightness); // 0-255

    // syncRTCwithNTP();
  }

  // Alterno la visualizzazione del giorno della settimana e della data odierna
  static unsigned long Last_UPDATE_DataGiorno = 0;
  if (dataGiornoState == DATA)
  {
    if (millis() > Last_UPDATE_DataGiorno + 5000)
    {
      int leftSpace = centraStringa((String)daysOfTheWeek[now.dayOfTheWeek()]);
      dma_display->fillRect(0, 8, PANEL_RES_X, 8, 0);
      dma_display->setCursor(leftSpace, 8);
      dma_display->setTextSize(1);
      dma_display->setTextColor(dma_display->color565(60, 180, 60));
      dma_display->setTextWrap(false);
      dma_display->print(daysOfTheWeek[now.dayOfTheWeek()]);
      Last_UPDATE_DataGiorno = millis();
      dataGiornoState = GIORNO;
    }
  }
  else
  {
    if (millis() > Last_UPDATE_DataGiorno + 5000)
    {
      // int leftSpace = centraStringa("XXXXXXXXX");
      int leftSpace = 3;
      dma_display->fillRect(0, 8, PANEL_RES_X, 8, 0);
      dma_display->setCursor(leftSpace, 8);
      dma_display->setTextSize(1);
      dma_display->setTextColor(dma_display->color565(60, 180, 60));
      dma_display->print(leftPad(now.day(), 2));
      dma_display->setCursor(leftSpace + 14, 8);
      dma_display->print(months[now.month() - 1]);
      dma_display->setCursor(leftSpace + 34, 8);
      dma_display->print(now.year());
      Last_UPDATE_DataGiorno = millis();
      dataGiornoState = DATA;
    }
  }
}

void loop()
{
  delay(1); // Piccola pausa per evitare blocchi
  static boolean nextState = true;

  SinricPro.handle();

  // Aggiorna l'ora dal NTP ogni ora
  static unsigned long lastUpdateTime = 0;
  if (millis() > lastUpdateTime + timeUpdateInterval)
  {
    syncRTCwithNTP(); // Sincronizza ogni mez'ora
    Serial.println("Sincronizzazione RTC con NTP eseguita con successo.");
    lastUpdateTime = millis();
  }

  static unsigned long lastUpdateNews = 0;
  if (millis() > lastUpdateNews + newsUpdateInterval)
  {
    fetchRSSFeed();
    lastUpdateNews = millis();
  }

  if (orologioAttivo)
  {
    gestisciOrologio();
    nextState = false;
  }
  else
  {
    // Se l'orologio non è attivo, non fare nulla
    if (nextState == false)
    {
      dma_display->fillScreen(myBLACK); // Pulisce lo schermo
      nextState = true;
    }
  }
}
